home/programs/emacs/emacs.org
** Custom modeline (=cur-modline.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-modeline.el
:END:

#+begin_src emacs-lisp
  ;;; cur/modeline.el --- My custom modeline -*- lexical-binding: t -*-

  ;;; Commentary:
  ;;
  ;; This is my custom modeline.  This is here bascially because I don't want to
  ;; use doom modeline.

  ;;; Code:
  (defgroup cur-modeline nil
    "My custom modeline that tries to be minimal."
    :group 'mode-line)
  
  (defgroup cur-modeline-faces nil
    "The faces for my custom modeline."
    :group 'cur-modeline)

  (defun cur-mode-line/padding ()
    "Function to return padding so `mode-line-end-spaces' will be right aligned."
    (let ((r-length (length (format-mode-line mode-line-end-spaces))))
      (propertize " "
                  'display `(space :align-to (- right ,r-length)))))

  (setq-default mode-line-format
                '("%e"
                  (:eval
                   (when (and (mode-line-window-selected-p) defining-kbd-macro)
                     (propertize "  KMACRO  " 'face 'font-lock-string-face)))
                  (:eval
                   (when (and (mode-line-window-selected-p)
                              (buffer-narrowed-p)
                              (not (derived-mode-p 'Info-mode 'help-mode 'special-mode 'message-mode)))
                     (propertize "  NARROWED  " 'face 'font-lock-constant-face)))
                  (:eval
                   (when (and (member 'meow features) (mode-line-window-selected-p))
                     (propertize (format "  %s  " (upcase (symbol-name meow--current-state)))
                                 'face 'highlight)))
                  "  "
                  (:eval
                   (when (mode-line-window-selected-p)
                     (cond (buffer-read-only
                            (propertize "RO" 'face 'shadow))
                           ((buffer-modified-p)
                            (propertize "**" 'face 'shadow))
                           (t
                            (propertize "RW" 'face 'shadow)))))
                  "  "
                  (:eval
                   (propertize (format "%s" (buffer-name)) 'face 'bold))
                  "  "
                  (:eval
                   (if (mode-line-window-selected-p)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'warning)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'shadow)))
                  (:eval (cur-mode-line/padding))))

  (provide 'cur-modeline)
  ;;; cur-modeline.el ends here
#+end_src

** More Intuitive Isearch (=cur-isearch-meow.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-isearch-meow.el
:END:

This is my hacked together way of making ~isearch~ more "modal". I don't really like having to use a bunch of modifier keys just to search through text, but I really like the over all way that ~isearch~ is designed. In particular I like how well it works with keyboard macros and how well integrated it is with other emacs tool like ~occur~.

Really, this is just some wrapper functions to cancel ~isearch~ and run various meow functions and a hydra for the transient key bindings. I plan on doing more optimizations and better integrating isearch into meow but for now the somewhat hacky solution will have to do.

Just as a note to self, the command ~defhydra+~ can be use to override the hydra's keybindings.

#+begin_src emacs-lisp
  (require 'isearch)
  (require 'hydra)

  (defgroup isearch-meow nil
    "Setting for making isearch work better with meow."
    :group 'isearch)

  (defun isearch-meow-wrapper (&optional arg)
    (interactive (list 1))
    (progn
      (when (region-active-p)
        (call-interactively #'meow-cancel-selection))
      (cond ((< arg 1)
             (call-interactively #'isearch-backward))
            (t
             (call-interactively #'isearch-forward)))))

  (defun isearch-meow-exit-next-line()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-next)))

  (defun isearch-meow-exit-prev-line()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-prev)))

  (defun isearch-meow-exit-left()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-left)))

  (defun isearch-meow-exit-right()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-right)))

  (defun isearch-meow-exit-back-to-indentation()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-join)))

  (defun isearch-meow-exit-end-of-line()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-line)))

  (defun isearch-meow-exit-next-word()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-next-word)))

  (defun isearch-meow-exit-back-word()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-back-word)))

  (defun isearch-meow-insert ()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-insert)))

  (defun isearch-meow-append ()
    (interactive)
    (progn
      (call-interactively #'isearch-exit)
      (call-interactively #'meow-append)))

  (defhydra isearch-meow-hydra (:hint nil)
    ""
    ("`"   ignore)
    ("~"   ignore)
    ("1"   ignore)
    ("!"   ignore)
    ("2"   ignore)
    ("@"   ignore)
    ("3"   ignore)
    ("#"   ignore)
    ("4"   ignore)
    ("$"   ignore)
    ("5"   ignore)
    ("%"   ignore)
    ("6"   ignore)
    ("^"   ignore)
    ("7"   ignore)
    ("&"   ignore)
    ("8"   ignore)
    ("*"   ignore)
    ("9"   ignore)
    ("("   ignore)
    ("0"   ignore)
    (")"   ignore)
    ("a"   isearch-meow-append)
    ("A"   ignore)
    ("b"   isearch-meow-exit-back-word :exit t)
    ("B"   ignore)
    ("c"   isearch-query-replace-regexp)
    ("C"   ignore)
    ("d"   ignore)
    ("D"   ignore)
    ("e"   isearch-meow-exit-next-word :exit t)
    ("E"   ignore)
    ("f"   ignore)
    ("F"   ignore)
    ("g"   ignore)
    ("G"   ignore)
    ("l"   isearch-meow-exit-left)
    ("H"   ignore)
    ("i"   isearch-meow-insert)
    ("I"   ignore)
    ("j"   isearch-meow-exit-next-line :exit t)
    ("J"   ignore)
    ("k"   isearch-meow-exit-prev-line :exit t)
    ("K"   ignore)
    ("l"   isearch-meow-exit-right)
    ("L"   ignore)
    ("m"   isearch-meow-exit-back-to-indentation :exit t)
    ("M"   ignore)
    ("n"   isearch-repeat-forward)
    ("N"   ignore)
    ("o"   isearch-occur)
    ("O"   ignore)
    ("p"   isearch-repeat-backward)
    ("P"   ignore)
    ("q"   ignore)
    ("Q"   ignore)
    ("r"   isearch-query-replace-regexp)
    ("R"   ignore)
    ("s"   ignore)
    ("S"   ignore)
    ("t"   ignore)
    ("T"   ignore)
    ("u"   ignore)
    ("U"   ignore)
    ("v"   ignore)
    ("V"   ignore)
    ("w"   ignore)
    ("W"   ignore)
    ("x"   isearch-meow-exit-end-of-line :exit t)
    ("X"   ignore)
    ("y"   ignore)
    ("Y"   ignore)
    ("z"   ignore)
    ("Z"   ignore)
    ("-"   ignore)
    ("_"   ignore)
    ("="   ignore)
    ("+"   ignore)
    ("["   ignore)
    ("{"   ignore)
    ("]"   ignore)
    ("}"   ignore)
    ("\\"  ignore)
    ("|"   ignore)
    (";"   ignore)
    (":"   ignore)
    ("'"   ignore)
    ("\""  ignore)
    (","   ignore)
    ("<"   ignore)
    ("."   ignore)
    (">"   ignore)
    ("/"   nil :exit t)
    ("?"   ignore)
    ("RET" isearch-exit :exit t)
    ("<return>" isearch-exit :exit t)
    ("ESC" isearch-exit :exit t)
    ("<escape>" isearch-exit :exit t)
    ("SPC" ignore))

  (define-key isearch-mode-map (kbd "RET") 'isearch-meow-hydra/body)
  (define-key isearch-mode-map (kbd "<return>") 'isearch-meow-hydra/body)

  (provide 'cur-isearch-meow)
#+end_src
